#### EnableConceptualEnergyAnalyticalModel Method

---

|  |
| --- |
| EnergyDataSettings Class   See Also |

Turns on functionality related to conceptual energy analysis.

**Namespace:**   Autodesk.Revit.DB.Analysis
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
  **Since:**  2011

# Syntax

| C# |
| --- |
| ``` [ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyModel' property instead.")] public static bool EnableConceptualEnergyAnalyticalModel() ``` |

| Visual Basic |
| --- |
| ``` <ObsoleteAttribute("This method is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyModel' property instead.")> _ Public Shared Function EnableConceptualEnergyAnalyticalModel As Boolean ``` |

| Visual C++ |
| --- |
| ``` [ObsoleteAttribute(L"This method is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyModel' property instead.")] public: static bool EnableConceptualEnergyAnalyticalModel() ``` |

#### Return Value

Returns true if the Conceptual Energy Analytical model is turned on, false otherwise.

# See Also

EnergyDataSettings Class

Autodesk.Revit.DB.Analysis Namespace